cask_args appdir: "/Applications"

# taping repos
tap "homebrew/bundle"
tap "buo/cask-upgrade"

# nice program to explore AWS EC2 Spot instances
tap "alexei-led/spotinfo"
# login into Azure
tap "azure/kubelogin"
# DevOps Kung Fu Mafia repo
tap "devops-kung-fu/tap"
# The most customisable and low-latency cross platform/shell prompt renderer
tap "jandedobbeleer/oh-my-posh"
# Terraform version manager and other helpers
tap "kreuzwerker/taps"
# repo for kubectl-image plugin
tap "pete911/tap"
# repo for powerlevel10k
tap "romkatv/powerlevel10k"
# repo for sigstore
tap "sigstore/tap"
# repo for tfswitch
tap "warrensbox/tap"
# repo for Hashicorp
tap "hashicorp/tap"

# installing these packages
# C Foreign Function Interface for Python
# needed for ansible, ansible-lint, awscli, cryptography
brew "cffi"
brew "ansible"
brew "ansible-lint"

# cli for ArgoCD
brew "argocd"
# cli for AWS auth
brew "aws-iam-authenticator"
# cli for AWS
brew "awscli"
# cli for Azure
brew "azure-cli"

# nice replace for cat
brew "bat"
# nice replace for top
brew "btop"
brew "htop"

# cli for Cilium
brew "cilium-cli"
# cli for Cilium Hubble
brew "hubble"
# cli for cosign
brew "cosign"
# pinentry-mac is a tool for managing GPG keys
brew "pinentry-mac"

brew "direnv"
# This tool provides a way to discover and explore the contents of a docker image.
# Additionally the tool estimates the amount of wasted space and identifies the offending files from the image.
brew "dive"

# nice replace for ls
brew "eza"
# fuzzy finder helper
brew "fzf"
# ripgrep is a search tool that uses a glob pattern to match text.
brew "ripgrep"

# basic tools
# git
brew "git"
# gitsign is a tool for signing git commits and tags using age, the standard GNU Privacy Guard (GPG)
brew "gitsign"
# gnu verion of sed
brew "gnu-sed"
# golang
brew "go"
# work with helm charts
brew "helm"

# cheat is a tool for creating and managing a cheat sheet.
brew "cheat"
# jq is a lightweight and flexible command-line JSON processor. 
brew "jq"
# yq is a lightweight and portable command-line YAML, JSON, and XML processor.
brew "yq"

brew "k3d"
# k8s TUI client
brew "k9s"
# small local k8s cluster
brew "kind"
# cli for ko, ko is a simple Go application that allows you to build and push Docker images with ko.ko.
brew "ko"
# cli for kubernetes
brew "kubernetes-cli"
# kube-ps1 is a kubectl plugin that displays the current Kubernetes context and namespace in your shell prompt.
brew "kube-ps1"
# kubeconform is a tool for validating Kubernetes configuration files.
brew "kubeconform"
# kubectx is a tool that manages local Kubernetes clusters and associated contexts.
brew "kubectx"

# qemu is a generic and open source machine emulator and virtualizer.
brew "qemu"
# lima is a local Kubernetes cluster based on Lima (Linux virtual machines for macOS).
brew "lima"
# another local k8s cluster
brew "minikube"

# pipx is a tool to help you install and run Python applications in isolated environments.
brew "pipx"
# powerlevel10k is a theme for zsh
brew "powerlevel10k"
# python version manager
brew "pyenv"
# auth for AWS
brew "saml2aws"
# sync ecr images
brew "skopeo"
# cli for Hashicorp sops, sops is a tool that provides encryption and decryption of secrets.
brew "sops"
# security scanner for container images
brew "syft"
# editor for now
brew "vim"
# editor for future
brew "neovim"

# directory jumping using fzf
brew "zoxide"

# spotinfo is a tool for exploring AWS EC2 Spot instances
brew "alexei-led/spotinfo/spotinfo"
# kubelogin is a tool for logging into Azure
brew "azure/kubelogin/kubelogin"
# Scans SBOMs for security vulnerabilities.
brew "devops-kung-fu/tap/bomber"
# m1-terraform-provider-helper is a tool for managing Terraform providers on Apple Silicon Macs
brew "kreuzwerker/taps/m1-terraform-provider-helper"
# kubectl plugin for managing Docker images
brew "pete911/tap/kubectl-image"
# tfswitch is a tool for switching between different versions of Terraform
brew "warrensbox/tap/tfswitch"

# cli for Hashicorp vault
brew "hashicorp/tap/vault"
# cli for Hashicorp packer
brew "hashicorp/tap/packer"

# mas is a tool for managing macOS applications from the Mac App Store
brew "mas"

# neofetch is a command-line system information tool
brew "neofetch"
# zig is a general-purpose programming language and toolchain for building fast, optimally performing systems software.
brew "zig"

# alt-tab is a tool for switching between applications
cask "alt-tab"
# dbeaver is a universal database tool and SQL client
cask "dbeaver-community"
# cli for Finch, Finch is a CLI tool for managing Docker image by AWS
cask "finch"
# Fira Code is a monospaced font with programming ligatures.
cask "font-fira-code"
# Google Cloud SDK
cask "google-cloud-sdk"
# hiddenbar is a menubar replacement for macOS
cask "hiddenbar"
# aws session manager plugin
cask "session-manager-plugin"
# temurin is a distribution of OpenJDK
cask "temurin"
# warp is a modern terminal
cask "warp"
# raycast is a powerful command-line tool to search and launch applications
cask "raycast"
# rancher desktop is a desktop UI for kubernetes
cask "rancher"
# the unarchiver is a tool for unpacking and repacking archives
cask "the-unarchiver"
# zed is a modern editor
cask "zed"
# obsidian is a knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# rancher desktop is a desktop UI for kubernetes
cask "rancher"
# CLI from Mitchell Hashimoto
cask "ghostty"
