cask_args appdir: "/Applications"

# =========================================================
# Taps (External Repositories)
# =========================================================

tap "homebrew/bundle"
tap "homebrew/command-not-found"        # Suggests packages when commands not found
tap "buo/cask-upgrade"                  # Upgrade manager for casks
tap "alexei-led/spotinfo"               # AWS EC2 Spot instances explorer
tap "azure/kubelogin"                   # Azure Kubernetes login
tap "databricks/tap"                    # Databricks tools
tap "devops-kung-fu/tap"                # DevOps Kung Fu Mafia repo
tap "jandedobbeleer/oh-my-posh"         # Cross-platform/shell prompt renderer
tap "kreuzwerker/taps"                  # Terraform version manager and helpers
tap "pete911/tap"                       # kubectl-image plugin
tap "robusta-dev/krr"                   # Kubernetes resource reader
tap "romkatv/powerlevel10k"             # Powerlevel10k ZSH theme
tap "txn2/tap"                          # Various tools
tap "vmware-tanzu/pinniped"             # Authentication system for Kubernetes
tap "warrensbox/tap"                    # tfswitch
tap "hashicorp/tap"                     # Hashicorp tools

# =========================================================
# Shell & Terminal Enhancements
# =========================================================

# Modern shell utilities
brew "bat"                              # Better cat
brew "btop"                             # Better top
brew "eza"                              # Better ls
brew "fzf"                              # Fuzzy finder
brew "ripgrep"                          # Fast grep
brew "yazi"                             # Terminal file manager
brew "zoxide"                           # Smarter cd command
brew "direnv"                           # Environment switcher
brew "gnu-sed"                          # GNU version of sed

# Shell customization
brew "powerlevel10k"                    # ZSH theme
brew "kube-ps1"                         # Kubernetes prompt info

# =========================================================
# Development Tools
# =========================================================

# Version Control
brew "git"                              # Git
brew "gitsign"                          # Git commit signing

# Programming Languages
brew "go"                               # Golang
brew "zig"                              # Zig language
brew "cffi"                             # C Foreign Function Interface for Python
brew "pyenv"                            # Python version manager
brew "pipx"                             # Python application installer

# Editors
brew "vim"                              # Text editor
brew "neovim"                           # Modern vim

# =========================================================
# DevOps & Cloud Tools
# =========================================================

# Infrastructure as Code
brew "warrensbox/tap/tfswitch"          # Terraform version manager
brew "kreuzwerker/taps/m1-terraform-provider-helper" # Terraform provider helper for Apple Silicon
brew "hashicorp/tap/packer"             # Machine image builder
brew "hashicorp/tap/vault"              # Secrets management

# Configuration Management
brew "ansible"                          # Infrastructure automation
brew "ansible-lint"                     # Ansible linter
brew "sops"                             # Secrets encryption

# Cloud Providers
brew "awscli"                           # AWS CLI
brew "aws-iam-authenticator"            # AWS auth
brew "saml2aws"                         # AWS SAML auth
brew "azure-cli"                        # Azure CLI
brew "azure/kubelogin/kubelogin"        # Azure Kubernetes login
brew "alexei-led/spotinfo/spotinfo"     # AWS EC2 Spot instances explorer

# =========================================================
# Kubernetes & Container Tools
# =========================================================

# Kubernetes CLI & Tools
brew "kubernetes-cli"                   # kubectl
brew "kubecolor"                        # Colorize kubectl output
brew "danielfoehrkn/switch/switch"      # kubectx/kubens replacement
brew "pete911/tap/kubectl-image"        # kubectl image plugin
brew "k9s"                              # Kubernetes TUI
brew "argocd"                           # ArgoCD CLI
brew "helm"                             # Kubernetes package manager
brew "kubeconform"                      # Kubernetes manifest validator

# Container Tools
brew "dive"                             # Docker image explorer
brew "skopeo"                           # Container image tool
brew "ko"                               # Go container builder
brew "cosign"                           # Container signing
brew "syft"                             # SBOM generator
brew "devops-kung-fu/tap/bomber"        # SBOM security scanner

# Local Kubernetes
brew "kind"                             # Kubernetes in Docker
brew "k3d"                              # k3s in Docker
brew "minikube"                         # Local Kubernetes
brew "lima"                             # Linux VMs on macOS
brew "qemu"                             # Machine emulator

# Specialized Kubernetes Tools
brew "cilium-cli"                       # Cilium CLI
brew "hubble"                           # Cilium Hubble

# =========================================================
# Data Processing & Utilities
# =========================================================

brew "jq"                               # JSON processor
brew "yq"                               # YAML processor
brew "cheat"                            # Cheatsheet manager
brew "pinentry-mac"                     # GPG PIN entry
brew "mas"                              # Mac App Store CLI

# =========================================================
# Desktop Applications (Casks)
# =========================================================

# Development Tools
cask "dbeaver-community"                # Database tool
cask "zed"                              # Modern editor
cask "warp"                             # Modern terminal
cask "ghostty"                          # Terminal from Mitchell Hashimoto
cask "temurin"                          # OpenJDK distribution
cask "google-cloud-sdk"                 # Google Cloud tools
cask "session-manager-plugin"           # AWS Session Manager
cask "rancher"                          # Kubernetes desktop UI
cask "virtualbox"                       # Virtualization software

# Productivity & Utilities
cask "alt-tab"                          # Window switcher
cask "hiddenbar"                        # Menu bar manager
cask "raycast"                          # Launcher & productivity tool
cask "the-unarchiver"                   # Archive utility
cask "obsidian"                         # Knowledge base

# Fonts
cask "font-fira-code"                   # Programming font with ligatures
